In [1]:
import pandas as pd
import numpy as np

In [9]:
%%writefile sales_data.csv
연도,판매량,매출,순이익
2015,103,500000,370000
2016,70,300000,190000
2017,130,400000,300000
2018,60,550000,480000
2019,190,700000,600000
2020,230,680000,590000

Overwriting sales_data.csv

In [11]:
sales_data = pd.read_csv('sales_data.csv', index_col='연도', header=0, sep=',')

In [36]:
sales_data = {
 '연도':[2015, 2016, 2017, 2018, 2019, 2020],
 '판매량':[103, 70, 130, 160, 190, 230],
 '매출':[500000, 300000, 400000, 550000, 700000, 680000],
 '순이익':[370000, 190000, 300000, 480000, 600000, 590000]
}

In [37]:
sales_data = pd.DataFrame(sales_data)

In [38]:
sales_data

     연도  판매량      매출     순이익
0  2015  103  500000  370000
1  2016   70  300000  190000
2  2017  130  400000  300000
3  2018  160  550000  480000
4  2019  190  700000  600000
5  2020  230  680000  590000

In [39]:
sales_data['순이익율'] = (sales_data['순이익']/sales_data['매출']) * 100

In [40]:
def check(n):
    if n > 80:
        return '높음'
    else:
        return '낮음'

In [41]:
# sales_data['순이익율_비교'] = sales_data['순이익율'].call(check)
# sales_data
sales_data['순이익율_비교'] = sales_data['순이익율'].apply(check)
sales_data

     연도  판매량      매출     순이익       순이익율 순이익율_비교
0  2015  103  500000  370000  74.000000      낮음
1  2016   70  300000  190000  63.333333      낮음
2  2017  130  400000  300000  75.000000      낮음
3  2018  160  550000  480000  87.272727      높음
4  2019  190  700000  600000  85.714286      높음
5  2020  230  680000  590000  86.764706      높음

In [52]:
sales_data["teat2"] = (sales_data[sales_data['판매량'] <100]['판매량']+50)

In [53]:
sales_data

     연도  판매량      매출     순이익  teat2
0  2015  103  500000  370000    NaN
1  2016   70  300000  190000  120.0
2  2017  130  400000  300000    NaN
3  2018  160  550000  480000    NaN
4  2019  190  700000  600000    NaN
5  2020  230  680000  590000    NaN
6  2021  360  720000  650000    NaN

In [54]:
sales_data.loc[6] = [2021, 360, 720000, 650000, "",0]

ValueError: Must have equal len keys and value when setting with an iterable

In [55]:
sales_data.drop(['순이익율','순이익율_비교'],axis=1,inplace=True)

KeyError: "['순이익율' '순이익율_비교'] not found in axis"

In [56]:
sales_data

     연도  판매량      매출     순이익  teat2
0  2015  103  500000  370000    NaN
1  2016   70  300000  190000  120.0
2  2017  130  400000  300000    NaN
3  2018  160  550000  480000    NaN
4  2019  190  700000  600000    NaN
5  2020  230  680000  590000    NaN
6  2021  360  720000  650000    NaN

In [112]:
sales_data1 = {
    '연도':[2015, 2016, 2017, 2018],
    '판매량':[103, 70, 130, 160],
    '매출':[500000, 300000, 400000, 550000],
    '순이익':[370000, 190000, 300000, 480000]
 }

sales_data2 = {
    '연도':[2019, 2020],
    '판매량':[190, 230],
    '매출':[700000, 680000],
    '순이익':[ 600000, 590000]
}

In [113]:
sales_data1 = pd.DataFrame(sales_data1)
sales_data2 = pd.DataFrame(sales_data2)

In [115]:
sales_data1.append(sales_data2,ignore_index=True)

     연도  판매량      매출     순이익
0  2015  103  500000  370000
1  2016   70  300000  190000
2  2017  130  400000  300000
3  2018  160  550000  480000
4  2019  190  700000  600000
5  2020  230  680000  590000

In [122]:
sales_df = pd.concat([sales_data1,sales_data2],ignore_index=True)

In [118]:
cost_data = {
    '연도':[2015, 2016, 2017, 2018],
    '이자':[1520, 1120, 1360, 1680],
    '관리비':[650, 400, 750, 800],
    '세금':[12000, 8900, 10900, 12800] }

In [119]:
cost_data = pd.DataFrame(cost_data)

In [125]:
pd.merge(sales_df, cost_data, on='연도', how='inner')

     연도  판매량      매출     순이익    이자  관리비     세금
0  2015  103  500000  370000  1520  650  12000
1  2016   70  300000  190000  1120  400   8900
2  2017  130  400000  300000  1360  750  10900
3  2018  160  550000  480000  1680  800  12800

In [126]:
pd.merge(sales_df, cost_data, on='연도', how='outer')

     연도  판매량      매출     순이익      이자    관리비       세금
0  2015  103  500000  370000  1520.0  650.0  12000.0
1  2016   70  300000  190000  1120.0  400.0   8900.0
2  2017  130  400000  300000  1360.0  750.0  10900.0
3  2018  160  550000  480000  1680.0  800.0  12800.0
4  2019  190  700000  600000     NaN    NaN      NaN
5  2020  230  680000  590000     NaN    NaN      NaN

In [127]:
pd.merge(sales_df, cost_data, on='연도', how='left')

     연도  판매량      매출     순이익      이자    관리비       세금
0  2015  103  500000  370000  1520.0  650.0  12000.0
1  2016   70  300000  190000  1120.0  400.0   8900.0
2  2017  130  400000  300000  1360.0  750.0  10900.0
3  2018  160  550000  480000  1680.0  800.0  12800.0
4  2019  190  700000  600000     NaN    NaN      NaN
5  2020  230  680000  590000     NaN    NaN      NaN

In [128]:
pd.merge(sales_df, cost_data, on='연도', how='right')

     연도  판매량      매출     순이익    이자  관리비     세금
0  2015  103  500000  370000  1520  650  12000
1  2016   70  300000  190000  1120  400   8900
2  2017  130  400000  300000  1360  750  10900
3  2018  160  550000  480000  1680  800  12800

In [132]:
df = pd.DataFrame(np.random.randint(1, 100, size=(8, 2)),
index=[['A창고','A창고','A창고','A창고','B창고','B창고','B창고','B창고'],
['사과','배','바나나','사과','사과','배','바나나','배']],
columns=['판매','재고'])
df.index.names = ['창고명','상품명']

In [133]:
df

         판매  재고
창고명 상품명
A창고 사과   93  44
    배    84  56
    바나나  92  18
    사과   73  10
B창고 사과   60   9
    배    61   2
    바나나  56  13
    배    73  77

In [139]:
df.groupby('창고명').sum()

      판매   재고
창고명
A창고  342  128
B창고  250  101

In [140]:
df.groupby('상품명').sum()

      판매   재고
상품명
바나나  148   31
배    218  135
사과   226   63

In [187]:
df.groupby(['창고명','상품명']).sum()

KeyError: '창고명'

## 실습02

In [188]:
df = pd.DataFrame(np.random.randint(1, 100, size=(15, 3)),
index=[['1학년','1학년','1학년','1학년','1학년','2학년','2학년','2학년','2학년','2학년','3학년','3학년','3학년','3학년','3학년'],
['1반','2반','3반','4반','5반','1반','2반','3반','4반','5반','1반','2반','3반','4반','5반']],
columns=['국어','영어','과학'])

In [158]:
df['총점'] = df['국어'] + df['영어'] + df['과학']

In [160]:
df["평균"] = df['총점'] / 3

In [172]:
df

        국어  영어  과학   총점         평균
1학년 1반  42  94  12  148  49.333333
    2반  63  94  78  235  78.333333
    3반  91  64  82  237  79.000000
    4반  25  56  19  100  33.333333
    5반  49  58   9  116  38.666667
2학년 1반  46  94  90  230  76.666667
    2반  42  17  76  135  45.000000
    3반  96  74  30  200  66.666667
    4반  14  60  70  144  48.000000
    5반   9  91  39  139  46.333333
3학년 1반  29  66   4   99  33.000000
    2반   5  19  41   65  21.666667
    3반  10  82  19  111  37.000000
    4반   9  63  32  104  34.666667
    5반  43  81  93  217  72.333333

In [175]:
df_index = df
df_index.index.names=['학년','반']

In [182]:
df_index = df_index.groupby('학년').sum()

In [186]:
df_index['평균'] = df_index['평균']/5
df_index

      국어   영어   과학   총점         평균
학년
1학년  270  366  200  836  55.733333
2학년  207  336  305  848  56.533333
3학년   96  311  189  596  39.733333

## 실습03

In [297]:
#df 선언
df_titanic = pd.read_csv('titanic_train.csv')

### 실습 03-1 결측지처리를해주세요.(age-평균값적용,Cabin-N으로,Embarked-N)

In [299]:
df_titanic['Age'] = df_titanic['Age'].fillna(df_titanic['Age'].mean())
df_titanic['Cabin'] = df_titanic['Cabin'].fillna('N')
df_titanic['Embarked'] = df_titanic['Embarked'].fillna('N')

### 실습03-2 성별(Sex)생존자합을구해주세요

In [300]:
df_titanic.groupby('Sex').sum()['Survived']

Sex
female    233
male      109
Name: Survived, dtype: int64

### 실습03-3 클래스(Pclass)별생존자합을구해주세요

In [301]:
df_titanic.groupby('Pclass').sum()['Survived']

Pclass
1    136
2     87
3    119
Name: Survived, dtype: int64

### 실습03-4 나이(Age)를활용유아,10대,20대,30대,40대,50대,60대,노인의생존자합을구해주세요.

In [305]:
conlist = [(df_titanic['Age']<10),
((df_titanic['Age']>=10) & (df_titanic['Age']<20)),
((df_titanic['Age']>=20) & (df_titanic['Age']<30)),
((df_titanic['Age']>=30) & (df_titanic['Age']<40)),
((df_titanic['Age']>=40) & (df_titanic['Age']<50)),
((df_titanic['Age']>=50) & (df_titanic['Age']<60)),
((df_titanic['Age']>=60) & (df_titanic['Age']<70)),
(df_titanic['Age'])>=70]

choilist =['유아','10대','20대','30대','40대','50대','60대','노인']

df_titanic["Ages"] = np.select(conlist,choilist,default='Not Specified')

df_titanic.groupby('Ages').mean()['Survived']

Ages
10대    0.401961
20대    0.324937
30대    0.437126
40대    0.382022
50대    0.416667
60대    0.315789
노인     0.142857
유아     0.612903
Name: Survived, dtype: float64

## 실습03
### 실습03-1 30대이면서1등석에탄사람의수

In [310]:
df_titanic[(df_titanic["Ages"] == '30대')&(df_titanic['Pclass'] == 1)]['Pclass'].count()

50

### 실습03-2 클래스(Pclass)별나이평균

In [309]:
df_titanic.groupby("Pclass").mean()['Age']

Pclass
1    37.048118
2    29.866958
3    26.403259
Name: Age, dtype: float64

### 실습03-3 클래스(Pclass)와성별에따른생존율

In [311]:
df_titanic.groupby(['Pclass','Sex']).mean()['Survived']

Pclass  Sex
1       female    0.968085
        male      0.368852
2       female    0.921053
        male      0.157407
3       female    0.500000
        male      0.135447
Name: Survived, dtype: float64

### 실습 03-4 나이(Age)대별로생존율구하기

In [296]:
df_titanic2 = pd.read_csv('titanic_train.csv')

conlist = [(df_titanic2['Age']<10),
((df_titanic2['Age']>=10) & (df_titanic2['Age']<20)),
((df_titanic2['Age']>=20) & (df_titanic2['Age']<30)),
((df_titanic2['Age']>=30) & (df_titanic2['Age']<40)),
((df_titanic2['Age']>=40) & (df_titanic2['Age']<50)),
((df_titanic2['Age']>=50) & (df_titanic2['Age']<60)),
((df_titanic2['Age']>=60) & (df_titanic2['Age']<70)),
((df_titanic2['Age']>=70) & (df_titanic2['Age']<80)),
(df_titanic2['Age']>=80)]

choilist =['0','10','20','30','40','50','60','70','80']

df_titanic2["Ages_2"] = np.select(conlist,choilist,default='-1')

df_titanic2.groupby('Ages_2').mean()['Survived']

Ages_2
-1    0.293785
0     0.612903
10    0.401961
20    0.350000
30    0.437126
40    0.382022
50    0.416667
60    0.315789
70    0.000000
80    1.000000
Name: Survived, dtype: float64